In [44]:
import pandas as pd             # data package
import matplotlib.pyplot as plt # graphics 
import datetime as dt
import numpy as np

import requests, io             # internet and input tools  
import zipfile as zf            # zip file tools 
import os  

#import weightedcalcs as wc
#import numpy as np

import pyarrow as pa
import pyarrow.parquet as pq

In [45]:
file_path = os.getcwd()

fig_path = file_path +"\\figures"

In [46]:
### STEP1 ###
print("")
print("**********************************************************************************")
print("Downloading and processing BLS file")
print("")

url = "https://data.bls.gov/cew/data/files/2017/csv/2017_annual_singlefile.zip"
# This will read in the annual, single file. It's big, but has all we want...

r = requests.get(url) 

# convert bytes to zip file  
bls_sf = zf.ZipFile(io.BytesIO(r.content)) 
print('Type of zipfile object:', type(bls_sf))

clist = ['area_fips', 'own_code', 'industry_code', 'agglvl_code', 'size_code',
       'year', 'disclosure_code', 'annual_avg_estabs',
       'annual_avg_emplvl', 'total_annual_wages','avg_annual_pay']

df = pd.read_csv(bls_sf.open(bls_sf.namelist()[0]), usecols= clist)

# SHOULD PRESPECIFY TYPES TO 

df.head()

**********************************************************************************
Downloading and processing BLS file

Type of zipfile object: <class 'zipfile.ZipFile'>

/var/folders/60/4kc0p2cn3w5_067bvcmybpbw0000gn/T/ipykernel_60056/3036768764.py:20: DtypeWarning: Columns (0) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv(bls_sf.open(bls_sf.namelist()[0]), usecols= clist)

,area_fips,own_code,industry_code,agglvl_code,size_code,year,disclosure_code,annual_avg_estabs,annual_avg_emplvl,total_annual_wages,avg_annual_pay
0,1000,0,10,50,0,2017,NaN,124881,1936819,89088710816,45997
1,1000,1,10,51,0,2017,NaN,1208,53131,4339038631,81668
2,1000,1,102,52,0,2017,NaN,1208,53131,4339038631,81668
3,1000,1,1021,53,0,2017,NaN,610,11173,716001109,64083
4,1000,1,1022,53,0,2017,NaN,2,12,369309,30354

In [47]:
df.shape
# df.to_csv("/Users/changjay/Desktop/Pandas-to-STATA Project/countylevel_tariffs_and_exports/step1_initial.csv")
# df.to_stata("/Users/changjay/Desktop/Pandas-to-STATA Project/countylevel_tariffs_and_exports/countylevel_tariffs_and_exports.dta")

(3561646, 11)

In [48]:
NAICS_county_level = 75 
# This is the code that will select only counties at the 3 digit NAICS level

df_county = df[df.agglvl_code == NAICS_county_level].copy()
df_county.shape

(274608, 11)

In [49]:
df_county = df_county[df_county.own_code == 5]
# Only grab private stuff
df_county.shape
# df_county.head()

(203667, 11)

In [50]:
### Caution ###
df_county['area_fips'] = df['area_fips'].astype(str) # the author forgot this command.
### The author forgot to transform the data type of area_fips and the code in his repository actually do nothing this part. 
### But if this command is run with other commands, there will be no error warning. (I guess that's why he didn't detect this error.)
### So I add this command myself. However, the result is just slightly different.
# df_county.area_fips.dtype
df_county = df_county[(df_county.area_fips.str[0:2] != "72") & (df_county.area_fips.str[0:2] != "78")
              & (df_county.area_fips.str[0:2] != "02") & (df_county.area_fips.str[0:2] != "15")]
# Drop puerto rico, alaska, hawaii...this mayb not be doing what I think it is...as it looks like these guys are there
# Does not matter as analysis is performed withthem, drop them when do the map. 
df_county.head()

,area_fips,own_code,industry_code,agglvl_code,size_code,year,disclosure_code,annual_avg_estabs,annual_avg_emplvl,total_annual_wages,avg_annual_pay
3016,1001,5,111,75,0,2017,N,4,0,0,0
3026,1001,5,112,75,0,2017,NaN,3,27,848146,31905
3033,1001,5,113,75,0,2017,NaN,4,36,2901165,80032
3040,1001,5,115,75,0,2017,NaN,9,27,2007731,74132
3052,1001,5,212,75,0,2017,N,4,0,0,0

In [51]:
# This part does not matter at all.
df_county["sup_ind"] = df_county.industry_code.str[1].astype(int)
# sometimes there are super industries floating around we want to drop them.
# not clear if this matters with the conditioning all ready

df_county = df_county[df_county["sup_ind"] > 0]

df_county.area_fips = df_county.area_fips.astype(str)

df_county.shape

(199393, 12)

In [52]:
df_national = df_county.groupby("industry_code").agg({"annual_avg_emplvl": "sum"})
df_national.shape
df_national.head()

               annual_avg_emplvl
industry_code
111                       527459
112                       226092
113                        45166
114                         5005
115                       352782

In [53]:
df_national.reset_index(inplace = True)
df_national.rename({"annual_avg_emplvl":"nat_emplvl"}, axis = 1, inplace = True)
df_national.head()

df_national.to_csv("/Users/changjay/Desktop/Pandas-to-STATA Project/countylevel_tariffs_and_exports/step1_pandas.csv") # for checking

In [54]:
df_county.annual_avg_emplvl.sum()

114942685

In [55]:
### STEP2 ###
print("")
print("**********************************************************************************")
print("Downloading and processing Trade Data")
print("")

my_key = "&key=34e40301bda77077e24c859c6c6c0b721ad73fc7"
# This is my key. I'm nice and I have it posted. If you will be doing more with this
# please get your own key!

end_use = "hs?get=E_COMMODITY,CTY_CODE,ALL_VAL_MO,CTY_NAME"

url = "https://api.census.gov/data/timeseries/intltrade/exports/" + end_use 
url = url + my_key + "&time==from+2015-01" + "&COMM_LVL=HS6"

url = url + "&CTY_CODE=5700"

r = requests.get(url) 

df_china_trade = pd.DataFrame(r.json()[1:]) # This then converts it to a dataframe
# Note that the first entry is the labels

df_china_trade.columns = r.json()[0]

df_china_trade.time = pd.to_datetime(df_china_trade.time, format="%Y-%m")
# This is so I can call this correctly...

df_china_trade["china_trade"] = df_china_trade.ALL_VAL_MO.astype(float)

df_china_trade.E_COMMODITY = df_china_trade.E_COMMODITY.astype(str)

df_china_trade.tail(10)

**********************************************************************************
Downloading and processing Trade Data

,E_COMMODITY,CTY_CODE,ALL_VAL_MO,CTY_NAME,time,COMM_LVL,CTY_CODE,china_trade
348602,854511,5700,7150,CHINA,2022-09-01,HS6,5700,7150.0
348603,854519,5700,144730,CHINA,2022-09-01,HS6,5700,144730.0
348604,854520,5700,231117,CHINA,2022-09-01,HS6,5700,231117.0
348605,854590,5700,205085,CHINA,2022-09-01,HS6,5700,205085.0
348606,854610,5700,13241,CHINA,2022-09-01,HS6,5700,13241.0
348607,854620,5700,129908,CHINA,2022-09-01,HS6,5700,129908.0
348608,854690,5700,164031,CHINA,2022-09-01,HS6,5700,164031.0
348609,854710,5700,1186382,CHINA,2022-09-01,HS6,5700,1186382.0
348610,854720,5700,2873020,CHINA,2022-09-01,HS6,5700,2873020.0
348611,854790,5700,3585398,CHINA,2022-09-01,HS6,5700,3585398.0

In [56]:
df_china_trade.shape

(348612, 8)

In [57]:
df_china_trade.to_csv("/Users/changjay/Desktop/Pandas-to-STATA Project/countylevel_tariffs_and_exports/step2_china.csv")

In [58]:
r

In [59]:
end_use = "hs?get=E_COMMODITY,ALL_VAL_MO"

url = "https://api.census.gov/data/timeseries/intltrade/exports/"
url = url + end_use + my_key + "&time==from+2015-01" + "&COMM_LVL=HS6"

r = requests.get(url) 

df_all_trade = pd.DataFrame(r.json()[1:]) # This then converts it to a dataframe
# Note that the first entry is the labels

df_all_trade.columns = r.json()[0]

df_all_trade.time = pd.to_datetime(df_all_trade.time, format="%Y-%m")
# This is so I can call this correctly...

df_all_trade["total_trade"] = df_all_trade.ALL_VAL_MO.astype(float)

df_all_trade.E_COMMODITY = df_all_trade.E_COMMODITY.astype(str)

df_all_trade.head(10)

  E_COMMODITY ALL_VAL_MO       time COMM_LVL  total_trade
0      600544       4546 2015-01-01      HS6       4546.0
1      600542      53239 2015-01-01      HS6      53239.0
2      600541       8175 2015-01-01      HS6       8175.0
3      600534     497405 2015-01-01      HS6     497405.0
4      600533    1993074 2015-01-01      HS6    1993074.0
5      600532   10793848 2015-01-01      HS6   10793848.0
6      600531    1621489 2015-01-01      HS6    1621489.0
7      600523      33574 2015-01-01      HS6      33574.0
8      600522    1305273 2015-01-01      HS6    1305273.0
9      600521     146116 2015-01-01      HS6     146116.0

In [60]:
df_all_trade.shape

(487163, 5)

In [61]:
df_all_trade.to_csv("/Users/changjay/Desktop/Pandas-to-STATA Project/countylevel_tariffs_and_exports/step2_world.csv")

In [62]:
dftrade = df_all_trade.merge(df_china_trade[["E_COMMODITY", "time","china_trade"]], left_on = ["E_COMMODITY", "time"], 
                             right_on = ["E_COMMODITY", "time"], how = "left")

dftrade.set_index("time", inplace = True)

dftrade.drop(["ALL_VAL_MO"], axis = 1, inplace = True)

In [63]:
dftrade.head()

           E_COMMODITY COMM_LVL  total_trade  china_trade
time
2015-01-01      600544      HS6       4546.0          NaN
2015-01-01      600542      HS6      53239.0          NaN
2015-01-01      600541      HS6       8175.0          NaN
2015-01-01      600534      HS6     497405.0          NaN
2015-01-01      600533      HS6    1993074.0          NaN

In [64]:
dftrade.to_csv("/Users/changjay/Desktop/Pandas-to-STATA Project/countylevel_tariffs_and_exports/step2_pandas.csv") # for checking

In [65]:
### STEP 3 ###
dftrade_17 = dftrade.loc["2017"].groupby("E_COMMODITY").agg({"china_trade":"sum"})
dftrade_17.head(10)

             china_trade
E_COMMODITY
010121           29098.0
010129           27975.0
010130            8340.0
010190               0.0
010221           80280.0
010229            2682.0
010231            3806.0
010239            5000.0
010290               0.0
010310        10068288.0

In [66]:
#url = "https://www.census.gov/foreign-trade/reference/codes/concordance/expconcord17.xls"

#df_concordance = pd.read_excel(url, dtype = {"commodity": str, "naics": str})

#df_concordance["hs8"] = df_concordance.commodity.str[0:8]
# truncate down to get the hs8

#df_concordance["hs6"] = df_concordance.commodity.str[0:6]
# truncate down to get the hs6

#df_concordance["naics3"] = df_concordance["naics"].str[0:3]

#dict_concordance = dict(zip(df_concordance.hs6,df_concordance.naics)) 

# This creates a dictionaty from which we can map the hs6 to the naics codes

# Full disclosure. There is an issue with the creation of the dictionary as a unique 
# mapping from hs6 to naics. The notebook ``alt_hs_naics_mapping.ipynb'' provides a complete discussion.
# Ultimatly, this does not matter for the results (relative to the alternative below)

# Below is a fix/alternative approach to creating the mapping from hs6 to naics. In the
# cases where there are multiple naics codes for each hs6 code, it assigns the naics code that is
# associated with the most trade. 

# For future reference check this out: https://www.bea.gov/industry/zip/NDN0317.zip

file_path = os.getcwd()

alt_concordance = pq.read_table(file_path + "\\data\\alt_concordance.parquet").to_pandas()

alt_concordance.head()

dict_concordance = dict(zip(alt_concordance.hs6,alt_concordance.naics))

In [67]:
dftrade_17["hs6"] = dftrade_17.index

dftrade_17["naics"] = dftrade_17["hs6"].map(dict_concordance)

dftrade_17["naics4"] = dftrade_17["naics"].str[0:4]

dftrade_17["naics3"] = dftrade_17["naics"].str[0:3]

dftrade_17.rename({"china_trade":"2017_china_trade"}, axis = 1, inplace = True)

In [68]:
dftrade_17.head()

             2017_china_trade     hs6   naics naics4 naics3
E_COMMODITY
010121                29098.0  010121  112920   1129    112
010129                27975.0  010129  112920   1129    112
010130                 8340.0  010130  112920   1129    112
010190                    0.0  010190  112920   1129    112
010221                80280.0  010221  11211X   1121    112

In [69]:
dftrade_17_naics3 = dftrade_17.groupby("naics3").agg({"2017_china_trade": "sum"})
dftrade_17_naics3.head()

        2017_china_trade
naics3
111         1.578548e+10
112         1.066820e+08
113         1.316022e+09
114         1.322142e+09
211         6.730487e+09

In [70]:
df_national = df_national.merge(dftrade_17_naics3["2017_china_trade"],
                                left_on = "industry_code", right_index = True, how = "left")

In [71]:
df_national

   industry_code  nat_emplvl  2017_china_trade
0            111      527459      1.578548e+10
1            112      226092      1.066820e+08
2            113       45166      1.316022e+09
3            114        5005      1.322142e+09
4            115      352782               NaN
..           ...         ...               ...
87           811     1295936               NaN
88           812     1451476               NaN
89           813     1342158               NaN
90           814      281283               NaN
91           999      202801               NaN

[92 rows x 3 columns]

In [72]:
# create the "weights" by 
df_national["2017_china_trade"].replace(np.nan, 0, inplace = True)

df_national["trd_wts"] = (df_national["2017_china_trade"]/df_national["2017_china_trade"].sum())

In [73]:
df_national.trd_wts.sum()

1.0

In [77]:
df_national.to_stata("/Users/changjay/Desktop/Pandas-to-STATA Project/countylevel_tariffs_and_exports/step3_pandas.dta") # for checking

/Library/Frameworks/Python.framework/Versions/3.8/lib/python3.8/site-packages/pandas/io/stata.py:2491: InvalidColumnName:
Not all pandas column names were valid Stata variable names.
The following replacements have been made:

    2017_china_trade   ->   _2017_china_trade

If this is not what you expect, please make sure you have Stata-compliant
column names in your DataFrame (strings only, max 32 characters, only
alphanumerics and underscores, no Stata reserved words)

  warnings.warn(ws, InvalidColumnName)

In [31]:
dftrade["hs6"] = dftrade.E_COMMODITY

dftrade["naics"] = dftrade["hs6"].map(dict_concordance)

dftrade["naics4"] = dftrade["naics"].str[0:4]

dftrade["naics3"] = dftrade["naics"].str[0:3]

In [35]:
dftrade

,E_COMMODITY,COMM_LVL,total_trade,china_trade,hs6,naics,naics4,naics3
time,,,,,,,,
2015-01-01,600544,HS6,4546.0,NaN,600544,313240,3132,313
2015-01-01,600542,HS6,53239.0,NaN,600542,313240,3132,313
2015-01-01,600541,HS6,8175.0,NaN,600541,313240,3132,313
2015-01-01,600534,HS6,497405.0,NaN,600534,NaN,NaN,NaN
2015-01-01,600533,HS6,1993074.0,NaN,600533,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...
2022-09-01,630253,HS6,659928.0,NaN,630253,314120,3141,314
2022-09-01,630259,HS6,289023.0,NaN,630259,314120,3141,314
2022-09-01,630260,HS6,5369763.0,0.0,630260,314120,3141,314
2022-09-01,630291,HS6,1221352.0,9472.0,630291,314120,3141,314
2022-09-01,630293,HS6,439570.0,NaN,630293,314120,3141,314